// if

// روش ساختن ایف

// در این مثال اگه شرت ایف درست باشه نامبر ایز سی رو پرینت
// میکنه در غیر اینصورت فقط گودبای رو پرینت میکنه

// void main(List<String> args) {
//   int numbers = 30;
//   if (numbers == 30) {
//     print('number is 30');
//   }
//   print('Good bye');
// }

// // output:
// number is 30
// Good bye
// ----------------------------------------------------------------------------------
// else

//  الس یعنی در غیر اینصورت
// در این مثال گفتیم اگر عدد 12 بود پرینت کن عدد 12 است
// در غیر اینصورت پرینت کن عدد 12 نیست

// void main(List<String> args) {
//   int num = 12;
//   if (num == 12) {
//     print('adad 12 ast');
//   } else {
//     print('adad 12 nist');
//   }
// }

// output:
// adad 12 ast
// ------------------------------------------------------------------------------
// else if

// الس ایف مثل همون الیف پایتون هستش
// یعنی بعد از ایف اصلی  یه ال ایف  مینویسی
// و در اخر اگر تمام شرط ها رو چک کرد و به
// نتیجه نرسید اخر کر از الس خالی استفاده میکنیم

// void main(List<String> args) {
//   int num = -3;
//   if (num > 0) {
//     print('${num}: mosbateh!!');
//   } else if (num < 0) {
//     print('${num}: manfiye!!');
//   } else {
//     print('${num}: ziro hastesh');
//   }
// }

// output:
// -3: manfiye!!
// -----------------------------------------------------------------------------------------------
// اپروراتوهای منطقی در ایف
//  &&    ||

// && مثال and
// در این مثال چون از اند استفاده کردیم باید هر دو شرط
// درست باشد تا پیام خوشمد گویی چاپ شود

// void main(List<String> args) {
//   String name = 'omid';
//   String country = 'iran';
//   if (name == 'omid' && country == 'iran') {
//     print('Hello ${name} from ${country}');
//   } else {
//     print('user faild!!');
//   }
// }
// output:
// Hello omid from iran
// ----------------------------------------------------------------------------------

// || مثال or
// در این مثال چون از اور استفاده کردیم
// // اگر یک از شرط ها هم درست باشد پیام خوشامدگویی رو چاپ میکند

// void main(List<String> args) {
//   String name = 'omid';
//   String country = 'iran';
//   if (name == 'omid' || country == 'iran') {
//     print('Hello ${name} from ${country}');
//   } else {
//     print('user faild!!');
//   }
// }

// // output:
// // Hello omid from iran
// ====================================================================================================================
// ===================================================================================================================================

//  ایف های تو در تو

// مثال اول

// void main(List<String> args) {
//   num number = 5;
//   if (number >= 0) {
//     if (number == 0) {
//       print('adad 0 hast');
//     } else {
//       print('adad mosbate');
//     }
//   } else {
//     print('adad manfi ast!!');
//   }
// }

//outout:  5   = adad mosbate
//output:  0   =  adad 0 hast
//outtput: -5  =  adad manfi ast!!
//-------------------------------------------------------------------------------------------------------------------

//  ایف های تو در تو
// مثال دوم

// void main(List<String> args) {
//   int num = -5;
//   if (num % 2 == 0) {
//     if (num % 3 == 0) {
//       print('bar 3 va 2 taghsim pazir ast');
//     } else {
//       print('faghat bar 2 taghsim pazir ast');
//     }
//   } else {
//     if (num % 3 == 0) {
//       print('faghat bar 3 taghsim pazir ast');
//     } else {
//       print('na bar 3 va na bar 2 taghsim pazir ast');
//     }
//   }
// }

// output: 0 = bar 3 va 2 taghsim pazir ast
// output: 2 = faghat bar 2 taghsim pazir ast
// output: 3 = faghat bar 3 taghsim pazir ast
// output: -5 = na bar 3 va na bar 2 taghsim pazir ast
// ----------------------------------------------------------------------------------------------------------------------

//  ایف های تو در تو
// مثال سوم

// void main(List<String> args) {
//   int marks = 30;
//   if (marks > 80 && marks <= 100) {
//     print('A+');
//   } else if (marks > 60 && marks <= 80) {
//     print('A');
//   } else if (marks > 40 && marks <= 60) {
//     print('B');
//   } else {
//     print('C');
//   }
// }

// output: 90 = A+
// output: 70 = A
// output: 50 = B
// output: 30 = C
// ====================================================================================================================================
// ==========================================================================================================================================

//  این دو اپراتور برای این هست که
//ما بتونیم خیلی کوتاه شرط بنویسیم

// مثال اول
// void main(List<String> args) {
//   var ispublic = 21;
// //   اینجا اگر شرط درست باشه پابلیک رو برمیگردونه
// // ولی اگر شرط درست نباشه پرایویت رو برمیگردونه
//   String result = ispublic % 2 == 0 ? 'public' : 'private';
//   print(result);
// }

// output: 20 = public
// output: 21 = private
// ----------------------------------------------------------------------------------------------
// مثال دوم 
//  عملگر ?: (سه‌گانه) به صورت تو در تو
// در این مثال ما از سه شرط استفاده کردیم

// void main(List<String> args) {
//   num number = 12;
//   var result = number > 0 ? 'mosbat ast' : (number < 0 ? 'manfi ast' : 'sefr ast');
//   print(result);
// }

// output: 0   =   sefr ast
// output: 12  =   mosbat ast
// output: -12 =   manfi ast

// ------------------------------------------------------------------------------------------------------------------------

// استفاده این روش در نال سفتی
// با ؟؟ استفاده میکنیم

// در این مثال میگیم اگر کاربر یوزر رو وارد کرده بود یوزر رو نشون بده
// اما اگر یوزر رو نزده بود نال رو نشونش نده و کلمه ی مهمان رو نشونش بده

// روش اول

// void main(List<String> args) {
//   // رو چاپ کن  Guest اینجا گفتیم اگر نام نال بود به جای اینکه نال رو چاپ کنی کلمه
//   String playerName(String? name) => name ?? 'Guest';
//   print(playerName(null));
// }

// output:  null = Guest
// output:  omid  = omid
// ----------------------------------------------------------------------------------------------------------------------------
// روش دوم

// void main(List<String> args) {
//   String PlayerName(String? name) => name != null ? name : 'Guest';
//   print(PlayerName(null));
// }

// output:  null = Guest
// output:  omid  = omid
// -----------------------------------------------------------------------------------------------------------------------
// if روش سوم با استفاده از

// void main(List<String> args) {
//   String PlayerName(String? name) {
//     if (name != null) {
//       return name;
//     } else {
//       return 'Guest';
//     }
//   }

//   print(PlayerName(null));
// }

// output:  null = Guest
// output:  omid  = omid
// ---------------------------------------------------------------------------------------------------------------------------
// یک مثال هم از اعداد

// void main(List<String> args) {
//   var num = 3;
//   print((num < 2) ? 'true' : 'false');
// }

// output:       false
// ==============================================================================================================================
// =======================================================================================================================================
// if case

// if case  مزایای استفاده از
// ✔ کاهش پیچیدگی کد و خوانایی بهتر
// ✔ if-else عدم نیاز به چندین  پشت‌ سر‌هم
// ✔ ترکیب بررسی مقدار و نوع داده در یک شرط
// ✔ استفاده از الگوخوانی برای مدیریت داده‌های پیچیده


// مثال اول

// در این مثال گفتیم اگر فایل جیسون کلیدش استرینگ بود و مقدارش اینت بود
// اون متن مشخص شده رو پرینت کن در غیر این صورت
// پرینت کن که فایل جیسون ایراد داره

// void main(List<String> args) {
//   final json = {
//     'character': ['omid', 20]
//   };
// // خط اصلی شرط اینجاست
//   if (json case {'character': [String name, int age]}) {
//     print('$name is $age years old.');
//   } else {
//     throw 'corrupeted JSON';
//   }
// }

// output : 'character': ['omid', 20] = omid is 20 years old.
// output : 'character': ['omid', '20'] =  Unhandled exception: corrupeted JSON
// -----------------------------------------------------------------------------------------------------------
// مثال دوم
// بررسی مقدار ثابت
// با استفاده از ایف کسی می‌توان یک مقدار خاص را بررسی کرد:

// void main() {
//   int number = 20;

//   if (number case 10 || 20 || 30) {
//     print("عدد مجاز است");
//   }
// }

// output:     عدد مجاز است
// -----------------------------------------------------------------------------------------------------------
// مثال سوم
//  بررسی نوع داده
// ایف کیس می‌تواند نوع داده را بررسی کند و مقدار را در یک متغیر ذخیره کند


// void main() {
//   dynamic value = 42;

//   if (value case int number) {
//     print("یک عدد صحیح است: $number");
//   }
// }

// output:    یک عدد صحیح است: 42
// -------------------------------------------------------------------------------------------------------------------------------------
// Map بررسی مقدار داخل 
// می‌توان ایف کیس را برای بررسی مقدار درون یک مپ به کار برد:

// void main() {
//   Map<String, dynamic> data = {
//     "name": "Ali",
//     "age": 25,
//     "score": 85.5
//   };

//   if (data["score"] case double score) {
//     print("امتیاز یک عدد اعشاری است: $score");
//   }
// }

// output:      امتیاز یک عدد اعشاری است: 85.5

// ===================================================================================================================================================

// کار با اینپوت و ایف ها با هم

// یک برنامه بنویس که از کاربر یک عدد بگیره
// این عددی که میگیره بین 0 تا 100 باشه
// وقتی کاربر عدد رو داد مثلا 40 بود برنامه بگه که این عدد بین 0 تا 50 هستش
// اگر 70 زد بگه بین 50 تا 100 هستش
// اگر هم بیشتر از 100 بود بگه بزرگتر از 100 هستش

// import 'dart:io';

// void main(List<String> args) {
//   print('please enter a number betwen 0 and 100 : ');
//   String? input = stdin.readLineSync();

//   if (input != null) {
//     int number = int.parse(input);
//     if (number < 0) {
//       print('adad manfi nemitoni vared koni !!');
//     } else if (number <= 50) {
//       print('${number} adad bein 0 ta 50 ast !!');
//     } else if (number <= 100) {
//       print('${number} adad bein 51 ta 100 ast !!');
//     } else {
//       print('${number} adad bishtar az 100 ast !!');
//     }
//   }
// }
// ---------------------------------------------------------------------------------------------------------------------
