// حلقه  فور در دارت دو حالت داره

// مثال اول حالت اول
// حلقه فور سنتی → زمانی که تعداد دفعات اجرا مشخص باشد

// void main(List<String> args) {
//   // بنده فور سه قسمت داره
//   // قسمت اول شروع کننده که نوع متغییر و اسم و عددی که باید حلقه از اون شروع بشه
//   // سمت دوم شرط حلقه ی فور هستش
//   // قسمت سوم برای اینه که اون مقدار متغییر ی که
//   // در قسمت اول فور گزاشتیم رو یا کم کنیم یا زیاد کنیم
//   for (int i = 0; i < 3; i++) {
//     print(i);
//   }
// }

//output:
// 0
// 1
// 2
// --------------------------------------------------------------------------------------------------------------------------
// مثال دوم حالت اول حلقه ی فور

// در این مثال داخل بدنه ی فور از ایف هم استفاده کردیم
// که به حلقه گفتیم فقط اعداد زوج رو برامون پرینت کن

// void main(List<String> args) {
//   for (int i = 0; i < 10; i++) {
//     if (i % 2 == 0) {
//       print(i);
//     }
//   }
// }

// output:
// 0
// 2
// 4
// 6
// 8
// ---------------------------------------------------------------------------------------------------------------
// مثال سوم حالت اول
// به دست اوردن فاکتوریل عدد 5

// void main(List<String> args) {
//   int factorial = 1;
//   for (int i = 5; i >= 1; i--) {
//     factorial *= i;
//   }
//   print(factorial);
// }

// output:    120
// ===========================================================================================================================
// حالت دوم فور
// حلقه فور این  زمانی که بخواهیم عناصر یک مجموعه را به ترتیب پیمایش کنیم

// for in  که اصطلاحا بهش میگن
// مثل همون حلقه فور پایتون میمونه

// در این مثال با فور این روی اجزای لیست حرکت کردیم و آنهارو چاپ کردیم

// void main(List<String> args) {
//   List<int> lst = [1, 2, 3, 4, 5];
//   for (int i in lst) {
//     print(i);
//   }
// }

// output:
// 1
// 2
// 3
// 4
// 5
// --------------------------------------------------------------------------------------------------------
// forEach
// یک مثال از فور ایچ

// در این مثال شماره ایندکس هر ایتم در لیست رو مشخص کردیم با فور ایچ

// void main(List<String> args) {
//   List<int> lst = [1, 2, 3, 4, 5, 6, 7, 7];
//   int count = 0;
//   lst.forEach((a) => print('aitem ${count++} is $a '));
// }

// output:
// aitem 0 is 1
// aitem 1 is 2
// aitem 2 is 3
// aitem 3 is 4
// aitem 4 is 5
// aitem 5 is 6
// aitem 6 is 7
// aitem 7 is 7
// =========================================================================================================================

void main(List<String> args) {
  for (int i = 1; i <= 20; i++) {
    print(i);
  }
}
