// break
//بریک برای این هستش که ما بتونیم از حلقه بیایم بیرون

// مثال حلقه ی وایل
// در این مثال گفتیم وقتی به عدد پنج رسیدی از حلقه بیا بیرون و ادامه نده
// و متن داخل پرینت رو چاپ کن

// void main(List<String> args) {
//   int i = 1;
//   while (i <= 10) {
//     if (i %5 == 0) {
//         print('meshe inja chizi nevesht!!');
//         break;
//     }
//     print(i);
//     i++;
//   }
// }

// output:
// 1
// 2
// 3
// 4
// meshe inja chizi nevesht!!
// ---------------------------------------------------------------------------------------------------------
// break
// مثال بریک در حلقه ی فور
// در این مثال هم به حلقه گفتیم وقتی به عدد پنج رسیدی دیگه حلقه رو ادامه نده

// void main(List<String> args) {
//   for (int i = 1; i <= 10; i++) {
//     print(i);
//     if (i == 5) {
//         break;
//     }
//   }
// }

// output:
// 1
// 2
// 3
// 4
// 5
// ==========================================================================================================================
// continue
// کانتینیو هم برای اینه که ما شرطی را بزاریم ولی دیگه لازم نباشه حلقه رو متوقف کنیم
// و با کانتینیو به حلقه میگیم به کار خودش ادامه بده

// void main(List<String> args) {
//   for (int i = 1; i <= 10; i++) {
//     print(i);
//     if (i == 5) {
//         print('be adad 5 residam');
//         continue;
//     }
//   }
// }

// output:

// 1
// 2
// 3
// 4
// 5
// be adad 5 residam
// 6
// 7
// 8
// 9
// 10
// =====================================================================================================================
// Label  ما میتونیم برای حلقه هامون لیبیل یا اسم بزاریم
// این نام گزاری برای این به کار میاد
// که وقتی ما چندتا حلقه ی تودر تو داشته باشیم
//  و بخایم با بریک یا کانتینیو کار کنیم
// به بریک یا کانتینیو بتونیم اسم یا لیبیل اون حلقه مورد نظر رو بدیم

// در این مثال گفتیم وقتی به دو دو رسید بریک کن
// اینجا اگر از لیبیل استفاده نمیکردیم بریک نمیتونست بفهمه
// کدوم حلقه رو بشکونه و برنامه درست از حلقه خارج نمیشد

// void main(List<String> args) {
//   otherloop:
//   for (int i = 1; i <= 3; i++) {
//     for (int j = 1; j <= 3; j++) {
//       print('($i, $j)');
//       if (i == 2 && j == 2) {
//         break otherloop;
//       }
//     }
//   }
// }

// output:

// (1, 1)
// (1, 2)
// (1, 3)
// (2, 1)
// (2, 2)
// ================================================================================================

